ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_cpu2_ipc_rcv_regs.xml
<module id="CPU2_IPC_RCV_REGS" HW_revision="" description="CPU2 IPC RCV Registers">
	<group id="CPU2_IPC_RCV_REGS_RegisterFile0" name="CPU2_IPC_RCV_REGS_RegisterFile0" instances="4" offset="0x0" instaddr="2048">
		<register id="CPU1TOCPU2INTIPCSTS" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPU1TOCPU2INTIPCSTS Register">
			<bitfield id="IPC0" description="Local IPC Flag 0 Status" begin="0" end="0" width="1" rwaccess="R"/>
			<bitfield id="IPC1" description="Local IPC Flag 1 Status" begin="1" end="1" width="1" rwaccess="R"/>
			<bitfield id="IPC2" description="Local IPC Flag 2 Status" begin="2" end="2" width="1" rwaccess="R"/>
			<bitfield id="IPC3" description="Local IPC Flag 3 Status" begin="3" end="3" width="1" rwaccess="R"/>
			<bitfield id="IPC4" description="Local IPC Flag 4 Status" begin="4" end="4" width="1" rwaccess="R"/>
			<bitfield id="IPC5" description="Local IPC Flag 5 Status" begin="5" end="5" width="1" rwaccess="R"/>
			<bitfield id="IPC6" description="Local IPC Flag 6 Status" begin="6" end="6" width="1" rwaccess="R"/>
			<bitfield id="IPC7" description="Local IPC Flag 7 Status" begin="7" end="7" width="1" rwaccess="R"/>
			<bitfield id="IPC8" description="Local IPC Flag 8 Status" begin="8" end="8" width="1" rwaccess="R"/>
			<bitfield id="IPC9" description="Local IPC Flag 9 Status" begin="9" end="9" width="1" rwaccess="R"/>
			<bitfield id="IPC10" description="Local IPC Flag 10 Status" begin="10" end="10" width="1" rwaccess="R"/>
			<bitfield id="IPC11" description="Local IPC Flag 11 Status" begin="11" end="11" width="1" rwaccess="R"/>
			<bitfield id="IPC12" description="Local IPC Flag 12 Status" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="IPC13" description="Local IPC Flag 13 Status" begin="13" end="13" width="1" rwaccess="R"/>
			<bitfield id="IPC14" description="Local IPC Flag 14 Status" begin="14" end="14" width="1" rwaccess="R"/>
			<bitfield id="IPC15" description="Local IPC Flag 15 Status" begin="15" end="15" width="1" rwaccess="R"/>
			<bitfield id="IPC16" description="Local IPC Flag 16 Status" begin="16" end="16" width="1" rwaccess="R"/>
			<bitfield id="IPC17" description="Local IPC Flag 17 Status" begin="17" end="17" width="1" rwaccess="R"/>
			<bitfield id="IPC18" description="Local IPC Flag 18 Status" begin="18" end="18" width="1" rwaccess="R"/>
			<bitfield id="IPC19" description="Local IPC Flag 19 Status" begin="19" end="19" width="1" rwaccess="R"/>
			<bitfield id="IPC20" description="Local IPC Flag 20 Status" begin="20" end="20" width="1" rwaccess="R"/>
			<bitfield id="IPC21" description="Local IPC Flag 21 Status" begin="21" end="21" width="1" rwaccess="R"/>
			<bitfield id="IPC22" description="Local IPC Flag 22 Status" begin="22" end="22" width="1" rwaccess="R"/>
			<bitfield id="IPC23" description="Local IPC Flag 23 Status" begin="23" end="23" width="1" rwaccess="R"/>
			<bitfield id="IPC24" description="Local IPC Flag 24 Status" begin="24" end="24" width="1" rwaccess="R"/>
			<bitfield id="IPC25" description="Local IPC Flag 25 Status" begin="25" end="25" width="1" rwaccess="R"/>
			<bitfield id="IPC26" description="Local IPC Flag 26 Status" begin="26" end="26" width="1" rwaccess="R"/>
			<bitfield id="IPC27" description="Local IPC Flag 27 Status" begin="27" end="27" width="1" rwaccess="R"/>
			<bitfield id="IPC28" description="Local IPC Flag 28 Status" begin="28" end="28" width="1" rwaccess="R"/>
			<bitfield id="IPC29" description="Local IPC Flag 29 Status" begin="29" end="29" width="1" rwaccess="R"/>
			<bitfield id="IPC30" description="Local IPC Flag 30 Status" begin="30" end="30" width="1" rwaccess="R"/>
			<bitfield id="IPC31" description="Local IPC Flag 31 Status" begin="31" end="31" width="1" rwaccess="R"/>
		</register>
		<register id="CPU2TOCPU1INTIPCACK" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="CPU2TOCPU1INTIPCACK Register">
			<bitfield id="IPC0" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC0 bit" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="IPC1" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC1 bit" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="IPC2" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC2 bit" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="IPC3" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC3 bit" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="IPC4" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC4 bit" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="IPC5" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC5 bit" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="IPC6" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC6 bit" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="IPC7" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC7 bit" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="IPC8" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC8 bit" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="IPC9" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC9 bit" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="IPC10" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC10 bit" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="IPC11" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC11 bit" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="IPC12" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC12 bit" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="IPC13" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC13 bit" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="IPC14" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC14 bit" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="IPC15" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC15 bit" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="IPC16" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC16 bit" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="IPC17" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC17 bit" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="IPC18" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC18 bit" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="IPC19" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC19 bit" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="IPC20" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC20 bit" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="IPC21" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC21 bit" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="IPC22" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC22 bit" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="IPC23" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC23 bit" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="IPC24" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC24 bit" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="IPC25" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC25 bit" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="IPC26" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC26 bit" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="IPC27" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC27 bit" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="IPC28" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC28 bit" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="IPC29" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC29 bit" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="IPC30" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC30 bit" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="IPC31" description="Acknowledgement from CPU1 to CPU2TOCPU1IPCFLG.IPC31 bit" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
		<register id="CPU1TOCPU2INTIPCRECVCOM" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="CPU1TOCPU2INTIPCRECVCOM Register">
			<bitfield id="COMMAND" description="Refelects the state of CPU1TOCPU2INT IPCRECVCOM register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CPU1TOCPU2INTIPCRECVADDR" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="CPU1TOCPU2INTIPCRECVADDR Register">
			<bitfield id="ADDRESS" description="Refelects the state of CPU1TOCPU2INT IPCRECVADDR register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CPU1TOCPU2INTIPCRECVDATA" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="CPU1TOCPU2INTIPCRECVDATA Register">
			<bitfield id="DATA" description="Refelects the state of CPU1TOCPU2INT IPCRECVDATA register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CPU2TOCPU1INTLOCALREPLY" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="CPU2TOCPU1INTLOCALREPLY Register">
			<bitfield id="REPLY" description="CPU2 to CPU1 IPC Reply" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
	</group>
	<group id="CPU2_IPC_RCV_REGS_RegisterFile1" name="CPU2_IPC_RCV_REGS_RegisterFile1" instances="4" offset="0x2000" instaddr="2048">
		<register id="CPU3TOCPU2INTIPCSTS" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPU3TOCPU2INTIPCSTS Register">
			<bitfield id="IPC0" description="Local IPC Flag 0 Status" begin="0" end="0" width="1" rwaccess="R"/>
			<bitfield id="IPC1" description="Local IPC Flag 1 Status" begin="1" end="1" width="1" rwaccess="R"/>
			<bitfield id="IPC2" description="Local IPC Flag 2 Status" begin="2" end="2" width="1" rwaccess="R"/>
			<bitfield id="IPC3" description="Local IPC Flag 3 Status" begin="3" end="3" width="1" rwaccess="R"/>
			<bitfield id="IPC4" description="Local IPC Flag 4 Status" begin="4" end="4" width="1" rwaccess="R"/>
			<bitfield id="IPC5" description="Local IPC Flag 5 Status" begin="5" end="5" width="1" rwaccess="R"/>
			<bitfield id="IPC6" description="Local IPC Flag 6 Status" begin="6" end="6" width="1" rwaccess="R"/>
			<bitfield id="IPC7" description="Local IPC Flag 7 Status" begin="7" end="7" width="1" rwaccess="R"/>
			<bitfield id="IPC8" description="Local IPC Flag 8 Status" begin="8" end="8" width="1" rwaccess="R"/>
			<bitfield id="IPC9" description="Local IPC Flag 9 Status" begin="9" end="9" width="1" rwaccess="R"/>
			<bitfield id="IPC10" description="Local IPC Flag 10 Status" begin="10" end="10" width="1" rwaccess="R"/>
			<bitfield id="IPC11" description="Local IPC Flag 11 Status" begin="11" end="11" width="1" rwaccess="R"/>
			<bitfield id="IPC12" description="Local IPC Flag 12 Status" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="IPC13" description="Local IPC Flag 13 Status" begin="13" end="13" width="1" rwaccess="R"/>
			<bitfield id="IPC14" description="Local IPC Flag 14 Status" begin="14" end="14" width="1" rwaccess="R"/>
			<bitfield id="IPC15" description="Local IPC Flag 15 Status" begin="15" end="15" width="1" rwaccess="R"/>
			<bitfield id="IPC16" description="Local IPC Flag 16 Status" begin="16" end="16" width="1" rwaccess="R"/>
			<bitfield id="IPC17" description="Local IPC Flag 17 Status" begin="17" end="17" width="1" rwaccess="R"/>
			<bitfield id="IPC18" description="Local IPC Flag 18 Status" begin="18" end="18" width="1" rwaccess="R"/>
			<bitfield id="IPC19" description="Local IPC Flag 19 Status" begin="19" end="19" width="1" rwaccess="R"/>
			<bitfield id="IPC20" description="Local IPC Flag 20 Status" begin="20" end="20" width="1" rwaccess="R"/>
			<bitfield id="IPC21" description="Local IPC Flag 21 Status" begin="21" end="21" width="1" rwaccess="R"/>
			<bitfield id="IPC22" description="Local IPC Flag 22 Status" begin="22" end="22" width="1" rwaccess="R"/>
			<bitfield id="IPC23" description="Local IPC Flag 23 Status" begin="23" end="23" width="1" rwaccess="R"/>
			<bitfield id="IPC24" description="Local IPC Flag 24 Status" begin="24" end="24" width="1" rwaccess="R"/>
			<bitfield id="IPC25" description="Local IPC Flag 25 Status" begin="25" end="25" width="1" rwaccess="R"/>
			<bitfield id="IPC26" description="Local IPC Flag 26 Status" begin="26" end="26" width="1" rwaccess="R"/>
			<bitfield id="IPC27" description="Local IPC Flag 27 Status" begin="27" end="27" width="1" rwaccess="R"/>
			<bitfield id="IPC28" description="Local IPC Flag 28 Status" begin="28" end="28" width="1" rwaccess="R"/>
			<bitfield id="IPC29" description="Local IPC Flag 29 Status" begin="29" end="29" width="1" rwaccess="R"/>
			<bitfield id="IPC30" description="Local IPC Flag 30 Status" begin="30" end="30" width="1" rwaccess="R"/>
			<bitfield id="IPC31" description="Local IPC Flag 31 Status" begin="31" end="31" width="1" rwaccess="R"/>
		</register>
		<register id="CPU2TOCPU3INTIPCACK" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="CPU2TOCPU3INTIPCACK Register">
			<bitfield id="IPC0" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC0 bit" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="IPC1" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC1 bit" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="IPC2" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC2 bit" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="IPC3" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC3 bit" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="IPC4" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC4 bit" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="IPC5" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC5 bit" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="IPC6" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC6 bit" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="IPC7" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC7 bit" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="IPC8" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC8 bit" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="IPC9" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC9 bit" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="IPC10" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC10 bit" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="IPC11" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC11 bit" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="IPC12" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC12 bit" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="IPC13" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC13 bit" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="IPC14" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC14 bit" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="IPC15" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC15 bit" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="IPC16" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC16 bit" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="IPC17" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC17 bit" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="IPC18" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC18 bit" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="IPC19" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC19 bit" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="IPC20" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC20 bit" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="IPC21" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC21 bit" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="IPC22" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC22 bit" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="IPC23" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC23 bit" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="IPC24" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC24 bit" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="IPC25" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC25 bit" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="IPC26" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC26 bit" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="IPC27" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC27 bit" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="IPC28" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC28 bit" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="IPC29" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC29 bit" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="IPC30" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC30 bit" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="IPC31" description="Acknowledgement from CPU3 to CPU2TOCPU3IPCFLG.IPC31 bit" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
		<register id="CPU3TOCPU2INTIPCRECVCOM" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="CPU3TOCPU2INTIPCRECVCOM Register">
			<bitfield id="COMMAND" description="Refelects the state of CPU3TOCPU2INT IPCRECVCOM register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CPU3TOCPU2INTIPCRECVADDR" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="CPU3TOCPU2INTIPCRECVADDR Register">
			<bitfield id="ADDRESS" description="Refelects the state of CPU3TOCPU2INT IPCRECVADDR register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CPU3TOCPU2INTIPCRECVDATA" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="CPU3TOCPU2INTIPCRECVDATA Register">
			<bitfield id="DATA" description="Refelects the state of CPU3TOCPU2INT IPCRECVDATA register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
		<register id="CPU2TOCPU3INTLOCALREPLY" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="CPU2TOCPU3INTLOCALREPLY Register">
			<bitfield id="REPLY" description="CPU2 to CPU3 IPC Reply" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
	</group>
	<group id="CPU2_IPC_RCV_REGS_RegisterFile2" name="CPU2_IPC_RCV_REGS_RegisterFile2" instances="2" offset="0x6000" instaddr="4096">
	</group>
</module>
